stresstest/tester.yml
config:
  target: 'http://localhost:3003/api'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
    - duration: 60
      arrivalRate: 5
  processor: "./my-functions.js"


scenarios:
  - flow:
    - loop:
      - function: "randomId"
      - get:
          url: '/product/{{id}}'
    count: 1000